{
  "galleryPage": {
    "title": "ரே ஒளியியல் கேலரி",
    "description": "இது [வலை பயன்பாடு](/simulator) ஐப் பயன்படுத்தி செய்யப்பட்ட உருவகப்படுத்துதல்களின் தொகுப்பாகும், இது ஒளியியலின் ஊடாடும் டெமோக்களாகப் பயன்படுத்தப்படலாம். புதிய பொருட்களைப் பங்களிக்க உங்களை வரவேற்கிறோம். மேலும் தகவலுக்குப் பங்களிப்பு வழிகாட்டி](/contributing/gallery) ஐப் பார்க்கவும். ஒரு தவறைப் புகாரளிக்க, தயவுசெய்து [Github இல் ஒரு சிக்கலைத் திறக்கவும்](/github/issues) அல்லது மின்னஞ்சல் [ray-optics@phydemo.app](/email).",
    "categories": {
      "title": "வகைகள்",
      "reflection": "பிரதிபலிப்பு",
      "refraction": "ஒளித்திரிபு",
      "lens": "லென்ச்",
      "combinationOfLenses": "லென்ச்கள் சேர்க்கை",
      "grinOptics": "சாய்வு-குறியீட்டு ஒளியியல்",
      "miscellaneous": "மற்றவை"
    },
    "contributors_one": "பங்களிப்பாளர்: {{contributors}}",
    "contributors_other": "பங்களிப்பாளர்கள்: {{contributors}}",
    "openInSimulator": "சிமுலேட்டரில் திறந்திருக்கும்"
  },
  "galleryData": {
    "common": {
      "warningthesequenceof": "எச்சரிக்கை: ஒளியின் வரிசை ஒளியின் உண்மையான வேகத்தைக் குறிக்காது - இறுதி படம் மட்டுமே அர்த்தமுள்ளதாக இருக்கிறது."
    },
    "imagesFormedByTwoMirrors": {
      "title": "இரண்டு கண்ணாடியிலிருந்து படங்கள்",
      "description": "இந்த உருவகப்படுத்துதல் இரண்டு கண்ணாடிகளால் உருவாக்கப்பட்ட படங்களைக் காட்டுகிறது. பச்சை \"எல்\" என்பது பொருள். இரண்டு கண்ணாடிகளுக்கிடையேயான கோணம் \\(\\frac {360^\\circ} {n} \\) என்றால், \\(n-1 \\) மெய்நிகர் படங்கள் (ஆரஞ்சு L'S) உருவாக்கப்படும். அவற்றுக்கிடையேயான கோணத்தை மாற்றக் கண்ணாடியின் இறுதிப் புள்ளியை நீங்கள் இழுக்கலாம்."
    },
    "parabolicMirror": {
      "title": "பரவளைய கண்ணாடி",
      "description": "இந்த உருவகப்படுத்துதல் பரவளைய கண்ணாடியின் கவனம் செலுத்தும் சொத்தை நிரூபிக்கிறது."
    },
    "hyperbolicMirror": {
      "title": "ஐபர்போலிக் கண்ணாடி",
      "description": "இது ஐபர்போலிக் கண்ணாடியின் பிரதிபலிப்பு சொத்தின் ஒரு நிரூபணமாகும்: ஒரு கவனத்திலிருந்து ஐபர்போலிக் கண்ணாடியை நோக்கி பயணிக்கும் ஒளி கதிர்கள் மற்ற கவனத்திலிருந்து விலகிச் செல்லும்.\n\n ஐபர்போலாவின் இரண்டு ஃபோக்கள் ஆப்லிகாடிக் புள்ளிகள் ([அப்ளிகேனாடிக் புள்ளிகள்](/gallery/aplanatic-points) ஐப் பார்க்கவும்).",
      "theorangeraysareimag": "ஆரஞ்சு கதிர்கள் பிரதிபலித்த மஞ்சள் கதிர்களிடமிருந்து கற்பனை நீட்டிக்கப்பட்ட கதிர்கள்.\n இந்த கற்பனை கதிர்கள் மற்ற கவனம் புள்ளியில் ஒன்றிணைகின்றன.",
      "pointlightsourceaton": "ஒரு கவனம் புள்ளியில் புள்ளி ஒளி மூல"
    },
    "retroreflectors": {
      "title": "ரெட்ரோஃப்ளெக்டர்கள்",
      "description": "இது இரண்டு வகையான ரெட்ரோஃப்ளெக்டர்களின் உருவகப்படுத்துதல்:\n\n 1. கார்னர் ரெட்ரோஃப்ளெக்டர்.\n 2. பூனையின் கண் ரெட்ரோஃப்ளெக்டர்.",
      "dragtorotatethebeam": "இழுக்கவும்\n கற்றை சுழற்றுங்கள்",
      "catseyeretroreflecto": "பூனையின் கண் ரெட்ரோஃப்ளெக்டர்",
      "cornerretroreflector": "கார்னர் ரெட்ரோஃப்ளெக்டர்"
    },
    "periscope": {
      "title": "பெரிச்கோப்",
      "description": "இது இரண்டு தட்டையான கண்ணாடிகள் மற்றும் சில ஒளி தடுப்பான்களிலிருந்து தயாரிக்கப்பட்ட பெரிச்கோப்பின் உருவகப்படுத்துதல் ஆகும்.",
      "observerseyenottosca": "பார்வையாளரின் கண் (அளவிட வேண்டாம்)"
    },
    "newtonianTelescope": {
      "title": "நியூட்டனின் தொலைநோக்கி",
      "description": "இது ஒரு பிளச்ச்ல் ஓக்குலர் கொண்ட நியூட்டனின் தொலைநோக்கியின் மாதிரி."
    },
    "penroseUnilluminableRoom": {
      "title": "பென்ரோச் unilumanable அறை",
      "description": "பென்ரோச் அசைக்க முடியாத அறை நீள்வட்ட, வட்ட மற்றும் நேரியல் கண்ணாடியிலிருந்து கட்டப்பட்டுள்ளது. நீங்கள் எங்கு வைத்தாலும், அறைக்குள் ஒரு புள்ளி மூல (பச்சை) முழு அறையையும் பிரகாசிக்காது என்று சுவையான சொத்து உள்ளது. மூலத்தை நகர்த்த நீங்கள் பச்சை புள்ளியை இழுக்கலாம்.",
      "nomatterwhereyouputt": "புள்ளி மூலத்தை நீங்கள் எங்கு வைத்தாலும், அது முழு அறையையும் பிரகாசிக்காது.\n எச்சரிக்கை: எண் பிழை காரணமாக, சிறிது நேரம் கழித்து அது இன்னும் பிரகாசிக்கக்கூடும்."
    },
    "opticalCavity": {
      "title": "இரண்டு-துடிப்பு ஆப்டிகல் குழி",
      "description": "இது இரண்டு கண்ணாடிகளுடன் ஆப்டிகல் குழிக்குள் இருக்கும் கதிர்களின் உருவகப்படுத்துதல் ஆகும். குழியின் நீளம் \\(d \\), மற்றும் அதன் கண்ணாடியின் வளைவின் ஆரம் முறையே \\(r_1 \\) மற்றும் \\(r_2 \\) (ஒரு குழிவான கண்ணாடிக்கு \\(r> 0 \\) மாநாட்டுடன் . . இந்த உருவகப்படுத்துதலில் கண்ணாடிகள் சிறந்த வளைந்த கண்ணாடிகள் என்று கருதுகிறோம், அதாவது \\(f = \\frac {R} {R_1} \\), முந்தைய நிலைத்தன்மை நிலையை \\(0 \\leq (1- \\frac {d} {R_2}) (1- \\frac {d} {2}) \\leq 1 \\). [இங்கே](/gallery/resonator) என்பது கோள கண்ணாடிகளுடன் ஒத்த உருவகப்படுத்துதல் ஆகும், அங்கு முதல் ச்திரத்தன்மை நிலை பராக்சியல் தோராயத்தில் உள்ளது.",
      "clickholdleftmouseto": "சொடுக்கு + இடது சுட்டியை வைத்திருங்கள்\n கதிரை நகர்த்த",
      "dragtomovetheidealmi": "நகர்த்த இழுக்கவும்\n சிறந்த கண்ணாடி",
      "d400intheresonatorsb": "கீழே உள்ள ரெசனேட்டர்களில் டி = 400",
      "confocalresonator": "கன்ஃபோகல் ரெசனேட்டர்",
      "concentricresonator": "செறிவான ரெசனேட்டர்",
      "concaveconvexresonat": "குழிவான-குவிந்த ரெசனேட்டர்",
      "planoconcaveresonato": "பிளானோ-கான்கேவ் ரெசனேட்டர்"
    },
    "resonator": {
      "title": "பிளானோ-கான்கேவ் ரெசனேட்டர்",
      "description": "இது ஒரு பிளானோ-கான்கேவ் ரெசனேட்டரின் ஆர்ப்பாட்டமாகும். வளைவின் ஆரம் விட கண்ணாடிகளுக்கு இடையிலான தூரம் அதிகமாக இருந்தால், ரெசனேட்டர் நிலையற்றது. கண்ணாடிகளுக்கு இடையிலான தூரம் வளைவின் ஆரம் குறைவாகவோ அல்லது சமமாகவோ இருந்தால், ஒரு நிலையான ரெசனேட்டர் பயன்முறை உருவாகிறது.",
      "flatmirror": "தட்டையான கண்ணாடி",
      "sphericalconcavemirr": "கோளக் குழிவான கண்ணாடி",
      "unstableresonator": "நிலையற்ற ரெசனேட்டர்",
      "stableresonator": "நிலையான ரெசனேட்டர்"
    },
    "mazeSolution": {
      "title": "பிரமை தீர்வு",
      "description": "இது ஒரு பிரமைக்குள் தோன்றும் மற்றும் சுவர்களால் மீண்டும் மீண்டும் பிரதிபலிக்கும் ஒரு ஒளி கதிரின் உருவகப்படுத்துதல் ஆகும். பிரமைக்குள் பெரிய மற்றும் சிறிய சிவப்பு சதுரங்கள் (கீழே உள்ள ச்கிரீன்சாட்டில் காணப்படுகின்றன) முறையே ஒளி கதிரின் தோற்றம் மற்றும் ஆரம்ப திசையைக் குறிக்கின்றன. லைட் ரேயின் சில ஆரம்ப நோக்குநிலைகளுக்கு, அது பிரமை வெளியேறுகிறது, இதனால் கதவின் பாதையை திரும்பப் பெறுவதன் மூலம் பிரமைக்கு ஒரு தீர்வு கொள்கையளவில் கணக்கிடப்படலாம்.",
      "controltherayorigina": "கதிர் தோற்றம் மற்றும் ஆரம்ப திசையை கட்டுப்படுத்தவும்\n மேல் மற்றும் கீழ் குறிப்பான்களை இழுக்கிறது (முறையே).",
      "notethatthesimulatio": "உருவகப்படுத்துதல் செயலாக்கம் ஒரு முறை மட்டுமே முடிந்தது என்பதை நினைவில் கொள்க\n கீழ் இடது மூலையில் உள்ள செயலாக்க செய்தி மறைந்துவிடும்.",
      "mazeexit": "பிரமை வெளியேறுதல்"
    },
    "specularAndDiffuseReflection": {
      "title": "ஏகப்பட்ட மற்றும் பரவலான பிரதிபலிப்புகள்",
      "description": "ஒத்த விட்டங்கள் ஒரு மென்மையான மேற்பரப்பு மற்றும் தோராயமான மேற்பரப்பில் பிரகாசிக்கின்றன, இது ஏகப்பட்ட மற்றும் பரவலான பிரதிபலிப்புகளுக்கு இடையிலான வேறுபாட்டை விளக்குகிறது.",
      "specular": "மென்",
      "diffuse": "பரவுகிறது"
    },
    "chaffCountermeasure": {
      "title": "சஃப் எதிர்",
      "description": "இது ஒரு ரேடாரில் (மாறுபாடு விளைவுகளை புறக்கணித்தல்) ஏற்படுத்தும் விளைவின் ஒரு தரமான உருவகப்படுத்துதல் ஆகும்.",
      "plane": "தளம்",
      "radar": "கதிரலைக் கும்பா",
      "chaff": "சஃப்",
      "selectthechafftochan": "சாஃப் துண்டுகளின் எண்ணை (என்) மற்றும் நீளத்தை (எல்) மாற்ற சஃப் என்பதைத் தேர்ந்தெடுக்கவும்."
    },
    "causticsFromAReflectiveSphere": {
      "title": "ஒரு பிரதிபலிப்பு கோளத்திலிருந்து காச்டிக்ச்",
      "description": "நுழைவு துளையுடன் ஒரு பிரதிபலிப்பு ஒருங்கிணைந்த கோளம் (சிதறல் அல்ல). ஒரு திரவ துளிக்குள் (மழைத்துளி போன்றவை) பிரதிபலிப்புகளும் இருக்கலாம். புள்ளி மூலத்தை நகர்த்துவதன் மூலம் காச்டிக்ச் உருவாகும் இடத்தில் அழகான வடிவங்கள் வெளிப்படுகின்றன.",
      "movethepointsourcear": "புள்ளி மூலத்தை சுற்றி நகர்த்தவும்\n காச்டிக்ச் மற்றும் முனைகளைக் காண\n ஒருங்கிணைந்த கோளத்திற்குள் உருமாற்றம்.\n தடுப்பான்களின் அளவு மற்றும் நிலையை மாற்றவும்,\n மற்றும் கோளத்தின் தொடக்க அளவு\n மேலும் விளைவுகளைக் காண."
    },
    "theMirascope": {
      "title": "மிராச்கோப்",
      "description": "ஒரு ** மிராச்கோப் ** என்பது ஒரு கவர்ச்சிகரமான ஆப்டிகல் மாயை சாதனமாகும், இது முப்பரிமாண மிதக்கும் படத்தின் மாயையை உருவாக்க இரண்டு எதிரெதிர் பரவளைய கண்ணாடியைப் பயன்படுத்துகிறது. சாதனம் பின்வருமாறு:\n 1. கண்ணாடிகள் ஒரு குறிப்பிட்ட கட்டத்தில் ஒளியை மையப்படுத்த வடிவமைக்கப்பட்டுள்ளன. சாதனத்திற்குள் நுழைய அனுமதிக்க மேல் கண்ணாடியில் அதன் வெர்டெக்சில் ஒரு துளை உள்ளது.\n 2. ** ஒரு சிறிய பொருள் **: மிராச்கோப்பின் உள்ளே வைக்கப்படுகிறது, பொதுவாக மேல் கண்ணாடியின் மைய புள்ளிக்கு அருகில், அது கீழ் கண்ணாடியின் உச்சிக்கு மிக அருகில் உள்ளது.\n\n பொருளிலிருந்து ஒளி கண்ணாடிக்கு இடையில் பிரதிபலிக்கும் போது, அது மிராச்கோப்பின் மேற்பரப்புக்கு மேலே மிதக்கும் வாழ்நாள், முப்பரிமாண உருவமாகத் தோன்றும் வகையில் திருப்பி விடப்படுகிறது. மாயை மிகவும் உறுதியானது, மக்கள் பெரும்பாலும் படத்தைத் தொட முயற்சிக்கிறார்கள், அங்கே எதுவும் இல்லை என்பதைக் கண்டுபிடிக்க மட்டுமே.\n\n ஒளியியல், பிரதிபலிப்பு மற்றும் ஒளியின் நடத்தை ஆகியவற்றின் கொள்கைகளை விளக்கும் அறிவியல் ஆர்ப்பாட்டங்கள், பொம்மைகள் மற்றும் புதுமை உருப்படிகளில் மிராச்கோப்கள் பிரபலமாக உள்ளன.",
      "object1": "பொருள்",
      "realimage1": "உண்மையான படம்"
    },
    "reflect": {
      "title": "பிரதிபலிப்பு மற்றும் ஒளிவிலகல்",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு மேற்பரப்பில் பிரதிபலிப்பு மற்றும் ஒளிவிலகல் காட்டுகிறது."
    },
    "internalReflection": {
      "title": "உள் பிரதிபலிப்பு",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு மேற்பரப்பில் ஒளிவிலகல் மற்றும் உள் பிரதிபலிப்பைக் காட்டுகிறது."
    },
    "prisms": {
      "title": "பிரிசம்",
      "description": "இந்த உருவகப்படுத்துதல் வலது கோண ப்ரிசம், போரோ ப்ரிசம், ரோம்பாய்டு ப்ரிசம், டோவ் ப்ரிசம் மற்றும் பென்டாப்ரிசம் ஆகியவற்றை நிரூபிக்கிறது.",
      "rhomboid": "ரோம்பாய்டு",
      "rightangle": "வலது கோணம்",
      "porro": "மேலும்",
      "dove": "புறா",
      "pentaprism": "பென்டாப்ரிசம்"
    },
    "beamDirectors": {
      "title": "பீம் இயக்குநர்கள்",
      "description": "இது ஒரு வழக்கமான மற்றும் ஃப்ரெச்னல் இருமுனையின் உருவகப்படுத்துதல். ஒரு இருதரப்பு உள்வரும் மோதல் கற்றை இரண்டு திசைகளாக வழிநடத்தும், இது உச்ச கோணத்தைப் பொறுத்து.",
      "thisfresnelbiprismwa": "இந்த ஃப்ரெச்னல் இருமுனை மேற்கண்ட இரு பகுதிகளிலிருந்து தயாரிக்கப்பட்டது.\n நீங்கள் BIPRISM ஐத் தேர்ந்தெடுத்து N_slice அளவுருவை சரிசெய்யலாம்.",
      "fresnelbiprism": "ஃப்ரெச்னல் இருமுனை",
      "biprism": "இருதரப்பு"
    },
    "apparentDepth": {
      "title": "வெளிப்படையான ஆழம்",
      "description": "காற்றிலிருந்து நீருக்கடியில் ஒரு பொருளை நீங்கள் பார்க்கும்போது, பொருளின் ஆழம் அதன் உண்மையான ஆழத்தை விட சிறியதாகத் தோன்றுகிறது. இந்த நிகழ்வு ஒளியின் ஒளிவிலகல் காரணமாகும், மேலும் இந்த உருவகப்படுத்துதலில் நிரூபிக்கப்பட்டுள்ளது. வெளிப்படையான ஆழம் பார்வையாளரின் நிலையைப் பொறுத்தது, இது நீல வட்டத்தை இழுப்பதன் மூலம் நிரூபிக்கப்படலாம்.",
      "observedimageorange": "கவனிக்கப்பட்ட படம் (ஆரஞ்சு)",
      "observer": "நோக்காளன்",
      "objectunderwatergree": "பொருள் நீருக்கடியில் (பச்சை)"
    },
    "distortionInWindowsAndBacksideMirrors": {
      "title": "சன்னல்கள் மற்றும் பின்புற கண்ணாடியில் சிதைவு",
      "description": "ஒரு வளைந்த கோணத்தில் ஒரு கண்ணாடி வழியாக ஒரு பொருளைக் கவனிக்கும்போது, படம் ஒரு ஆஃப்செட்டில் தோன்றும் மற்றும் பார்வையாளருக்கு அருகில் இருக்க வேண்டும். உருவகப்படுத்துதல் இந்த விளைவை தடிமனான சாளரம் மற்றும் பின்புற கண்ணாடியில் காட்டுகிறது. \"அனைத்து படங்களும்\" பயன்முறையில் பார்ப்பது பட புள்ளிகள் உண்மையில் வளைவுகள் என்பதை நிரூபிக்கிறது, எனவே டிடெக்டர் அளவைப் பொறுத்து படம் தெளிவற்றதாக மாறக்கூடும். \n\nசட்டத்தின் வலதுபுறத்தில் நீங்கள் வெளிப்படையான அளவில் ஒரு ஆப்பு விளைவையும் காணலாம்.",
      "source": "மூலம்",
      "glass": "கண்ணாடி",
      "mirror": "முகக்கண்ணாடி",
      "image": "படம்",
      "observer3": "நோக்காளன்",
      "window": "சாளரம்"
    },
    "bendedPencil": {
      "title": "வளைந்த பென்சில்",
      "description": "இது ஒரு கிளாச் தண்ணீரில் ஓரளவு நீரில் மூழ்கிய பென்சிலில் மேலே இருந்து பார்க்கும்போது, நம் கண்களால் உணரப்பட்ட படத்தின் உருவகப்படுத்துதல். காற்று மற்றும் நீர் ஆகியவற்றுக்கு இடையேயான ஒளிவிலகல் குறியீட்டின் இடைநிறுத்தம் பென்சில் உடைந்த மற்றும் வளைந்திருக்கும். இருப்பினும், இந்த உருவகப்படுத்துதலில், வளைவு மேலும் வெளிப்படுகிறது. [உடைந்த பென்சில்](/gallery/broken-pencil) உருவகப்படுத்துதலை நீங்கள் சரிபார்க்கலாம், அங்கு பென்சில் உடைப்பது அதிகமாகக் காணப்படுகிறது.",
      "bentpencilyellowimag": "வளைந்த பென்சில் (மஞ்சள்)\n விழித்திரையில் படம்",
      "dielectricmaterial": "மின்கடத்தா பொருள்",
      "originalpencilgreen": "அசல் பென்சில் (பச்சை)",
      "observerseye": "பார்வையாளரின் கண்",
      "ignoretheorangesquar": "ஆரஞ்சு சதுரங்களை புறக்கணிக்கவும்!"
    },
    "brokenPencil": {
      "title": "உடைந்த பென்சில்",
      "description": "இது நம் கண்களால் உணரப்பட்ட படத்தின் உருவகப்படுத்துதல், ஒரு கிளாச் தண்ணீரில் ஓரளவு நீரில் மூழ்கிய பென்சிலில் பக்கத்திலிருந்து பார்க்கும்போது. காற்று மற்றும் நீர் ஆகியவற்றுக்கு இடையேயான ஒளிவிலகல் குறியீட்டின் இடைநிறுத்தம் பென்சில் உடைந்த மற்றும் வளைந்திருக்கும். இருப்பினும், இந்த உருவகப்படுத்துதலில், உடைப்பது மேலும் வெளிப்படுகிறது. [வளைந்த பென்சில்](/gallery/bended-pencil) உருவகப்படுத்துதலை நீங்கள் சரிபார்க்கலாம், அங்கு பென்சிலின் வளைவு அதிகமாகக் காணப்படுகிறது.",
      "brokenpencilyellowim": "உடைந்த பென்சில் (மஞ்சள்)\n விழித்திரையில் படம்"
    },
    "chromaticDispersion": {
      "title": "வண்ண சிதறல்",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு வெள்ளை நிற கற்றை மற்றும் முக்கோண ப்ரிசத்தைப் பயன்படுத்தி வண்ண சிதறலை நிரூபிக்கிறது. சிவப்பு, ஆரஞ்சு, மஞ்சள், பச்சை, சியான், நீலம் மற்றும் வயலட் வண்ணங்களை கலப்பதன் மூலம் இங்கே வெள்ளை நிறம் உருவாகிறது.",
      "dragheretoadjustbeam": "இங்கே இழுக்கவும்\n பீம் அகலத்தை சரிசெய்யவும்",
      "dragheretorotatethep": "இங்கே இழுக்கவும்\n ப்ரிசத்தை சுழற்றுங்கள்"
    },
    "rainbows": {
      "title": "ரெயின்போச்",
      "description": "இந்த உருவகப்படுத்துதல் முதன்மை வானவில், இரண்டாம் நிலை வானவில் மற்றும் அலெக்சாண்டரின் இருண்ட இசைக்குழு ஆகியவற்றை உருவாக்குவதை நிரூபிக்கிறது. இங்கே சூரிய ஒளியின் ச்பெக்ட்ரம் சிவப்பு, ஆரஞ்சு, மஞ்சள், பச்சை, சியான், நீலம் மற்றும் வயலட் வண்ணங்களைக் கலப்பதன் மூலம் தோராயமாக மதிப்பிடப்படுகிறது. முதன்மை/இரண்டாம் நிலை வானவில்லுக்கான வெளிச்செல்லும் கதிர்கள் மழைத்துளிக்குள் ஒன்று/இரண்டு உள் பிரதிபலிப்புகள் காரணமாகும் (கதிர் அடர்த்தியை குறைந்த எண்ணிக்கையில் அமைத்து மழைத்துளியை இழுப்பதன் மூலம் இதைக் காணலாம்). இவை மொத்த உள் பிரதிபலிப்புகள் அல்ல என்பதை நினைவில் கொள்க, எனவே வெளிச்செல்லும் கதிர்களின் தீவிரங்கள் உள்வரும் கதிர்களை விட மிகக் குறைவு. [குறைந்தபட்ச விலகல் கோணங்கள்](/gallery/minimum-deviation-angle) அலைநீளத்தைப் பொறுத்தது என்பதால், வெவ்வேறு வண்ணங்கள் வெவ்வேறு கோணங்களில் குவிகின்றன. எனவே ரெயின்போக்களில் உள்ள வண்ணங்கள் விளைவாக்கம் செய்யப்படுகின்றன. குறைந்தபட்ச கோணங்களிலிருந்து விலகி, கதிர்கள் குவிப்பதில்லை, எனவே எல்லா வண்ணங்களும் பலவீனமாகி ஒன்றாக கலக்கப்படுகின்றன, இரண்டு வானவில்லுக்கு வெளியே உள்ள கோணங்களில் மங்கலான வெள்ளை (அல்லது \"சாம்பல்\") நிறத்தை உருவாக்குகின்றன. மறுபுறம், இரண்டு ரெயின்போக்களுக்கு இடையில் எந்த கதிர்களும் கோணத்திற்குச் சென்று அலெக்சாண்டரின் இருண்ட இசைக்குழுவை உருவாக்குகின்றன.",
      "thesearethecolorspro": "இவை ஒரு மழைத்துளியில் இருந்து தயாரிக்கப்படும் வண்ணங்கள்.\n நாம் காணும் இறுதி ரெயின்போக்கள் வானத்தில் ஏராளமான மழைத்துளிகள் காரணமாகும்,\n அவை ஒவ்வொன்றும் பார்வையாளருக்கு ஒற்றை நிறத்தை (தொடர்புடைய கோணத்தில்) தருகின்றன.",
      "secondaryrainbow": "இரண்டாம் நிலை வானவில்",
      "alexandersdarkband": "அலெக்சாண்டரின் இருண்ட இசைக்குழு",
      "raindrop": "ரெண்ட்ரோப்",
      "primaryrainbow": "முதன்மை வானவில்",
      "sunlight": "சூரிய ஒளி"
    },
    "minimumDeviationAngle": {
      "title": "குறைந்தபட்ச விலகல் கோணம்",
      "description": "ஒரு ஒளியியல் உறுப்பைத் தாக்கும் ஒரு கதிரின் விலகல் கோணத்தின் வரையறை சூழலைப் பொறுத்தது - கீழே உள்ள ச்கிரீன்சாட்டில் ஒரு முக்கோண மற்றும் கோளப் ப்ரிசத்திற்கான அதன் வரையறையை நீங்கள் காணலாம். இந்த உருவகப்படுத்துதலுக்குள் உள்ள எடுத்துக்காட்டுகளில், ஆப்டிகல் உறுப்புக்குள் நுழையும் கதிரின் நிகழ்வு கோணத்தின் செயல்பாடாக விலகல் கோணம், விலகல் கோணத்தில் உள்ளக குறைந்தபட்சத்தைக் கொண்டுள்ளது, இது \"குறைந்தபட்ச விலகல் கோணம்\" என்று அழைக்கப்படுகிறது. இந்த உள்ளக குறைந்தபட்சம் [ரெயின்போச்](/gallery/rainbows) மற்றும் ஆலோச் போன்ற ஆப்டிகல் நிகழ்வுகளை விளக்க முடியும் - இந்த உள்ளக குறைந்தபட்சத்தின் காரணமாக, விலகிய கதிர்கள் குறிப்பிட்ட திசைகளில் குவிந்து, \"ஆப்டிகல் காச்டிக்ச்\" ஐ உருவாக்குகின்றன (உருவகப்படுத்துதலின் உள்ளே எடுத்துக்காட்டு சி இல் காணப்படுவது போல) இது ரெயின்போச்/ஆலோச் என நாம் உணர்கிறோம்.",
      "inexamplesaandbbyrot": "A மற்றும் B எடுத்துக்காட்டுகளில், புள்ளிகள் A1 முதல் A2 மற்றும் B1 க்கு இடையில் உள்ள ப்ரிசங்களை சுழற்றுவதன் மூலம், இதன் மூலம் மாற்றும்\n ஆப்டிகல் உறுப்புக்குள் நுழையும் கதிரின் நிகழ்வு கோணம், குறைந்தபட்சம் அதை நீங்கள் தெளிவாகக் கவனிக்கலாம்\n இணை புள்ளிகளுக்கு இடையில் எங்காவது விலகல் கோணம் அடையப்படுகிறது.\n (எடுத்துக்காட்டாக ஒரு விலகல் கோணம் ஒரு கிடைமட்ட அச்சுடன் ஒப்பிடும்போது அளவிடப்படுகிறது, அதேசமயம் எடுத்துக்காட்டு பி\n இது செங்குத்து அச்சுடன் ஒப்பிடும்போது அளவிடப்படுகிறது).\n\n இப்போது எடுத்துக்காட்டு சி (உருவகப்படுத்துதல் பெரிதாக்கத்தைப் பயன்படுத்தி) பெரிதாக்கவும், இரண்டு விட்டங்களையும் விரிவாக்குங்கள் (சிவப்பு மற்றும் ஊதா, மற்றும்\n அவர்களின் குறுக்குவெட்டு இளஞ்சிவப்பு நிறமாகத் தெரிகிறது. இது கோள ப்ரிசத்தை சுழற்றுவதைப் போன்றது\n எடுத்துக்காட்டு B, இதன் மூலம் நுழையும் கதிரின் நிகழ்வு கோணத்தை மாற்றுகிறது) மற்றும் புள்ளியிலிருந்து அதைக் கவனிக்கவும்\n சி 1 முதல் சி 2 பின்னோக்கி வெளியேறும் கதிர்கள் இரண்டு தனித்துவமான சிவப்பு மற்றும் ஊதா நிறத்தை நோக்கி குவிகின்றன\n கதிர்கள் (\"ஆப்டிகல் காச்டிக்ச்\") - குறைந்தபட்ச விலகல் கோணம் புள்ளி C2 ஐச் சுற்றி அடையப்படுகிறது, மேலும் சார்ந்துள்ளது\n ஒளி அலைநீளம் (நிறம்). பின்னர், இரண்டு விட்டங்களையும் புள்ளி C2 முதல் C3 வரை விரிவுபடுத்தும்போது, தி\n பின்தங்கிய வெளியேறும் கதிர்கள் அவற்றின் திசையை மேல்நோக்கி மாற்றியமைக்கின்றன.",
      "examplea": "எடுத்துக்காட்டு - அ",
      "examplec": "எடுத்துக்காட்டு - சி",
      "exampleb": "எடுத்துக்காட்டு - ஆ",
      "dragtorotate": "சுழற்ற இழுக்கவும்",
      "dragtoadjustbeamwidt": "பீம் அகலங்களை சரிசெய்ய இழுக்கவும்",
      "usethebuiltinzoomtob": "உருவகப்படுத்துதலுடன் சிறப்பாக தொடர்பு கொள்ள உள்ளமைக்கப்பட்ட சூம் பயன்படுத்தவும்",
      "deviationangle": "விலகல் கோணம்",
      "incidenceangle": "நிகழ்வு கோணம்"
    },
    "aplanaticPoints": {
      "title": "ஆபத்தான புள்ளிகள்",
      "description": "ஆப்டிகல் அமைப்பின் ஆப்டிகல் புள்ளிகள் அதன் ஆப்டிகல் அச்சில் சிறப்புப் புள்ளிகள், அதாவது \"அவற்றில் ஒன்றிலிருந்து தொடரும் கதிர்கள் அனைத்தும் ஒன்றிணைந்து, அல்லது மற்ற புள்ளியிலிருந்து வேறுபடுவதைக் காணும்\".\n\n - நீள்வட்டம்: நீள்வட்ட லென்ச்/கண்ணாடியின் இரண்டு ஃபோக்கள் உமிழும் புள்ளிகள், ஏனெனில் ஒரு கவனத்திலிருந்து வெளிப்படும் ஒளி மற்றொன்றை நோக்கி மாறும்.\n- Sphere: a spherical lens has two aplanatic points, inside and outside the sphere - for more details see the simulation.\n- Hyperbola: the two foci of the [Hyperbolic mirror](/gallery/hyperbolic-mirror) simulation are also aplanatic points.\n\n \\(X_1 \\) மற்றும் \\(x_2 \\) கிடைமட்ட ஆயத்தொகுப்புகளுடன் இரண்டு புள்ளிகளைக் கொடுத்தது, ஒரே மாதிரியான செங்குத்து ஆயத்தொகுப்புகள், மற்றும் ஒளிவிலகல் குறியீட்டை எங்கள் ஆப்டிகல் உறுப்புக்கு வெளியேயும் உள்ளே \\(n_1 \\) மற்றும் \\(n_2 \\) (முறையே), இந்த இரண்டு புள்ளிகள் எபிலாடிக் புள்ளிகளாக இருக்க வேண்டும், எங்கள் ஒளியியல் உறுப்பின் எல்லை \\begin{equation}k_1 n_1 \\sqrt{ (x - x_1)^2 + y^2} + k_2 n_2 \\sqrt{  (x - x_2)^2 + y^2} = E\\end{equation} அதாவது \\(k_i = 1 \\) அல்லது \\(-1 \\) கதிர் இணைக்கும் \\(x_i \\) மற்றும் எங்கள் ஒளியியல் உறுப்பின் எல்லை உண்மையான அல்லது கற்பனையாக இருந்தால், முறையே, மற்றும் \\(e \\) என்பது ஒரு மாறிலி, இதற்காக இந்தச் சமன்பாடு ஒரு கீழான தீர்வைக் கொண்டுள்ளது. இந்தச் சமன்பாடு (இது ஃபெர்மாட்டின் கொள்கையைப் பயன்படுத்தி பெறப்படலாம்) ஒரு கார்ட்டீசியன் ஓவலின் சமன்பாடு ஆகும், இதில் கோனிக் பிரிவுகள் சிறப்பு நிகழ்வுகள்.",
      "clickontheextendedra": "கோள லென்சில் (புள்ளி A) ஒளி மூலத்திலிருந்து வெளிப்படும் ஒளி என்பதை சரிபார்க்க \"நீட்டிக்கப்பட்ட கதிர்கள்\" பொத்தானைக் சொடுக்கு செய்க,\n கோள லென்சுக்கு வெளியே ஆப்டிகல் அச்சில் மற்றொரு புள்ளியிலிருந்து கோளங்கள் மாறுபாடு இல்லாமல் வேறுபடும்.\n புள்ளிகள் a மற்றும் b ஆகியவை கோளத்தின் ஆபத்தான புள்ளிகளுக்கு ஒரு எடுத்துக்காட்டு, இதற்காக (k1, k2, n1, n2, x1, x2, e) = (1, -1, 1.5, 1, 3 * 20, -4.5 * 20 , 0) குறிக்கப்பட்ட ஒய் அச்சுடன் தொடர்புடையது,\n ஃச் 1, ஃச் 2 முறையே A, B புள்ளிகளின் கிடைமட்ட ஒருங்கிணைப்புகளாகும் (ஒவ்வொரு கட்டம் கலமும் 20 முதல் 20 வரை பரிமாணங்களைக் கொண்டுள்ளது).\n இதேபோல், நீள்வட்டத்தின் (புள்ளிகள் சி மற்றும் டி) முகப்பு நீள்வட்டத்தின் ஆப்லிகேடிக் புள்ளிகளுக்கு ஒரு எடுத்துக்காட்டு, இதற்காக (கே 1, கே 2, என் 1, என் 2, இ) = (1, 1, 1.5, 1.5,> 0)",
      "sphericallens": "கோள லென்ச்",
      "ellipticallens": "நீள்வட்ட லென்ச்",
      "yaxis": "ஒய் அச்சு"
    },
    "concaveLens": {
      "title": "குழிவில்லை",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு குழிவான லென்சை ஒரு கற்றை வேறுபடுத்துவதைக் காட்டுகிறது."
    },
    "convexLens": {
      "title": "குவிவில்லை",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு குவிந்த லென்சை ஒரு கற்றை மாற்றுவதைக் காட்டுகிறது."
    },
    "lensImages": {
      "title": "லென்ச் படங்கள்",
      "description": "இந்த உருவகப்படுத்துதல் சிறந்த லென்ச்கள் தயாரிக்கும் ஒரு கற்றை மற்றும் புள்ளி மூலங்களின் படங்களைக் காட்டுகிறது."
    },
    "virtualImageFormation": {
      "title": "மெய்நிகர் பட உருவாக்கம்",
      "description": "இது ஒரு மெய்நிகர் படம் எவ்வாறு ஒன்றிணைக்கும் லென்ச் மற்றும் அதன் பண்புகள் மூலம் எவ்வாறு உருவாகிறது என்பதற்கான உருவகப்படுத்துதல் ஆகும்.",
      "object2": "பொருள்",
      "converginglensf1000u": "ஒன்றிணைக்கும் லென்ச் (f = 1000 அலகுகள்)",
      "virtualimagehighlyen": "மெய்நிகர் படம் \nமிகவும் விரிவாக்கப்பட்டது \nமேல்நேக்கி/நிமிர்ந்து"
    },
    "transverseAndLongitudinalMagnification": {
      "title": "குறுக்கு மற்றும் நீளமான உருப்பெருக்கம்",
      "description": "இது குவிய நீளம் \\(f \\) கொண்ட ஒரு சிறந்த லென்சுக்கு குறுக்குவெட்டு மற்றும் நீளமான உருப்பெருக்கத்தின் உருவகப்படுத்துதல் ஆகும். குறுக்குவெட்டு (நேரியல் என்றும் அழைக்கப்படுகிறது) மற்றும் நீளமான உருப்பெருக்கம் முறையே \\(m_t = 1- \\frac {u} {f} \\) மற்றும் \\(m_l = \\frac {dv} {du} \\), எங்கே \\(u \\) மற்றும் \\(v \\) என்பது முறையே நமது சிறந்த லென்சிலிருந்து பொருளின் தூரம் மற்றும் படமாகும். மேலும், ஒரு சிறந்த லென்சுக்கு \\(m_l =-(m_t)^2 \\)",
      "inthisexamplewehavey": "இந்த எடுத்துக்காட்டில் எங்களிடம் y'_j - y'_k = m_t * (y_j - y_k), அங்கு j, k∈ {0,1,2,3,4,5}.\n எனவே எடுத்துக்காட்டாக, புள்ளி பொருளின் (x_0, y_0) டிரான்வர்ச் உருப்பெருக்கம் m_t = -3 ஆகும், மேலும் நாம் கணக்கிடலாம் -\n (x'_0 - x'_1)/(x_1 - x_0) ≈ -0.3699\n (x'_0 - x'_2)/(x_2 - x_0) ≈ -0.7297\n (x'_0 - x'_3)/(x_3 - x_0) ≈ -1.4211\n (x'_0 - x'_4)/(x_4 - x_0) ≈ -2.4545\n (x'_0 - x'_5)/(x_5 - x_0) = -5.4\n .\n .\n .\n (விகிதம் நீளமான உருப்பெருக்கத்துடன் மாறும்: m_l = - (m_t)^2 = -9)",
      "rightclickonarealobj": "அதன் ஒருங்கிணைப்புகளைக் காண ஒரு (உண்மையான) பொருளை வலது சொடுக்கு செய்யவும்.\n பச்சை சதுரங்கள் உண்மையான புள்ளி மூலங்கள், மஞ்சள் சதுரங்கள் பட பொருள்கள்."
    },
    "vanishingPoint": {
      "title": "மறைந்துபோகும் புள்ளி",
      "description": "சில ஆப்டிகல் அமைப்புகள் எல்லையற்ற இணையான கோடுகளை, ஒரே கட்டத்தில் சந்திக்கும் பட விமானத்தில் உள்ள கோடுகளுக்கு, இணையான கோடுகள் \"முடிவிலியில்\" சந்திக்கின்றன என்ற மாயையை உருவாக்குகின்றன. இந்த ஒற்றை புள்ளி மறைந்துபோகும் புள்ளி என்று அழைக்கப்படுகிறது.\n\n \\(Xy \\) விமானத்தில் அமைந்துள்ள குவிய நீளம் \\(f \\) கொண்ட ஒரு சிறந்த லென்சைக் கொண்ட ஒரு ஆப்டிகல் அமைப்புக்கு, அதன் ஆப்டிகல் அச்சு \\(x \\) (கிடைமட்ட) அச்சுடன் ஒத்துப்போகிறது மற்றும் லென்ச் ஒத்துப்போகிறது \\(Y \\) அச்சு, \\(x <0 \\) இல் அமைந்துள்ள ஒரு சாய்வைக் கொண்ட \\(m \\) கொண்ட ஒரு வரிக்கான மறைந்துபோகும் புள்ளி, \\((x, y) \\) ஆயத்தொலைவுகள் \\((f (f , m f) \\).",
      "youcanverifythatapai": "சாய்வு - எம் கொண்ட ஒரு இணை இணையான கோடுகள், சிறந்த லென்சால் ஆயத்தொகுதிகளுக்கு (எஃப், எம் ∙ எஃப்) ஒன்றிணைகின்றன என்பதை நீங்கள் சரிபார்க்கலாம்,\n \"கட்டம்\" பொத்தானைக் சொடுக்கு செய்து, ஒவ்வொரு கட்டம் கலத்திற்கும் 20 ஆல் 20 பரிமாணங்கள் இருப்பதைக் கவனிப்பதன் மூலம்.\n சிறந்த லென்சின் குவிய நீளம் - எஃப், ஒருங்கிணைந்த புள்ளிகளை (மறைந்துபோகும் புள்ளிகள்) எவ்வாறு பாதிக்கிறது என்பதையும் நீங்கள் சரிபார்க்கலாம்.",
      "thesepairofparallell": "இந்த இணை இணையான கோடுகள் புள்ளி B க்கு ஒன்றிணைகின்றன",
      "thesepairofparallell1": "இந்த இணை இணையான கோடுகள் ஒரு புள்ளிக்கு ஒன்றிணைகின்றன",
      "notethatthesepairsof": "இந்த இணை இணையான கோடுகள் உண்மையில் எல்லையற்றவை அல்ல என்பதை நினைவில் கொள்க."
    },
    "monochromaticAberrations": {
      "title": "ஒரே வண்ணமுடைய பிறழ்வுகள்",
      "description": "இது வெவ்வேறு ஒற்றை நிற மாறுபாடுகளின் உருவகப்படுத்துதல்:\n\n 1. கோள மாறுபாடு.\n 2. கமா மாறுபாடு.\n 3. டிஃபோகச் மாறுபாடு.\n 4. புலம் வளைவு மாறுபாடு.",
      "defocusaberration": "டிஃபோகச் மாறுபாடு",
      "sphericalaberration": "கோள மாறுபாடு",
      "screen": "திரை",
      "fieldcurvatureaberra": "புல வளைவு மாறுபாடு",
      "commaaberration": "கமா மாறுபாடு"
    },
    "chromaticAberration": {
      "title": "வண்ண மாறுபாடு",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு கோள லென்சின் வண்ண மாறுபாட்டைக் காட்டுகிறது. சிவப்பு, ஆரஞ்சு, மஞ்சள், பச்சை, சியான், நீலம் மற்றும் வயலட் வண்ணங்களை கலப்பதன் மூலம் இங்கே வெள்ளை நிறம் உருவாகிறது. சிவப்பு ஒளியின் குவிய நீளம் மிகப்பெரியது, மற்றும் வயலட் ஒளியின் நீளம் மிகச்சிறியதாகும்.",
      "dragtoadjustbeamwidt1": "பீம் அகலத்தை சரிசெய்ய இழுக்கவும்"
    },
    "orientationsOfPlanoConvexLens": {
      "title": "பிளானோ-குவிந்த லென்சின் நோக்குநிலைகள்",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு பிளானோ-குவிந்த லென்சின் இரண்டு நோக்குநிலைகளை ஒரு கற்றை மையமாகக் கொண்டு ஒப்பிடுகிறது, இது வெவ்வேறு அளவிலான கோள மாறுபாடுகளை எடுத்துக்காட்டுகிறது."
    },
    "hyperbolicLens": {
      "title": "ஐபர்போலிக் லென்ச்",
      "description": "இது ஐபர்போலிக் மற்றும் கோள லென்ச்கள் இடையே ஒரு உருவகப்படுத்துதல் மற்றும் ஒப்பீடு ஆகும். இரண்டு லென்ச்கள் ஒரே மாதிரியான குவிய நீளங்களைக் கொண்டுள்ளன, ஆனால் கோள லென்சுக்கு மாறாக, ஐபர்போலிக் லென்ச் ஒரே புள்ளிக்கு ஒற்றை புள்ளிக்கு ஒரு இணையான கற்றையை (ஒளியின் அலை தன்மையை புறக்கணித்தல் - அதாவது வடிவியல் ஒளியியல் தோராயத்தில்) கோள மாறுபாடுகள் இல்லாமல் ஒருங்கிணைக்க முடியும்.",
      "thefocallengthofthis": "இந்த கோள லென்சின் குவிய நீளம் (பராக்சியல் தோராயத்தில்):\n f = r/(n-1) = 200/(1.5-1) = 400",
      "thefocallengthofthis1": "இந்த ஐபர்போலிக் லென்சின் குவிய நீளம்:\n f = | c | ∙ sqrt (n^2 - 1) / (n - 1) = k ∙ sqrt (0.8) ∙ sqrt (1.5^2 - 1) / (1.5 - 1) = 400\n இந்த ஐபர்போலாவிற்கான சமன்பாடு எங்கே:\n ஒய் (x) = (a/k) - sqrt (((x/k)^2 + (c/k)^2)/(n^2 - 1))\n = 1.5 - SQRT ((0.8 + (x / 200)^2) / (1.5^2 - 1))\n K என்பது கட்டம் பரிமாணங்களுக்கு சமன்பாடு பரிமாணங்களுக்கு இடையிலான மாற்ற மாறிலி - இந்த ஐபர்போலிக் லென்சுக்கு K = 200 க்கு.\n (எடுத்துக்காட்டாக 0 <y <y k ∙ ஒய் இன் செங்குத்து நீளத்துடன் ஒரு அடுக்குக்கு மாறுகிறது).",
      "selectthishyperbolic": "(இந்த ஐபர்போலிக் லென்சை அதன் தனிப்பயன் சமன்பாட்டைக் காணத் தேர்ந்தெடுக்கவும்)."
    },
    "fresnelLens": {
      "title": "ஃப்ரெச்னல் லென்ச்",
      "description": "இது ஒரு கோள மற்றும் ஃப்ரெச்னல் லென்சுக்கு இடையிலான உருவகப்படுத்துதல் மற்றும் ஒப்பீடு. ஃப்ரெச்னல் லென்சின் நன்மைகளில் ஒன்றை உடனடியாகக் காணலாம்: இது ஒரு வழக்கமான கோள லென்சைப் போலவே செயல்படுகிறது, அதே நேரத்தில் மிகக் குறைந்த இடத்தை எடுத்துக்கொள்கிறது - எனவே குறைவாக எடையும்.",
      "thisfresnellensismad": "இந்த ஃப்ரெச்னல் லென்ச் கீழே உள்ள அரை வட்ட கண்ணாடியிலிருந்து தயாரிக்கப்படுகிறது. \nநீங்கள் லென்சைத் தேர்ந்தெடுத்து N_SLICE அளவுருவை சரிசெய்யலாம்."
    },
    "zoomLens": {
      "title": "சூம் லென்ச்",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு சூம் லென்சை நிரூபிக்கிறது, அங்கு நீங்கள் குழிவான லென்சை நடுவில் இழுப்பதன் மூலம் சூம் மாற்றலாம்.",
      "dragtomovethelens": "லென்சை நகர்த்த இழுக்கவும்",
      "zoom": "← சூம்"
    },
    "compoundMicroscope": {
      "title": "கூட்டு நுண்ணோக்கி",
      "description": "ஒரு கூட்டு நுண்ணோக்கி இரண்டு லென்ச்கள், குறிக்கோள் மற்றும் கண் பார்வை ஆகியவற்றைக் கொண்டுள்ளது. பொருள் (பச்சை) ஒரு சிறிய பொருளைக் குறிக்கும் அச்சுக்கு மிக அருகில் உள்ளது. பொருள் இரண்டு லென்ச்கள் மூலம் பெரிதாக்கப்படுகிறது, இதனால் ஒரு பெரிய தலைகீழ் மெய்நிகர் படம் (இறுதி ஆரஞ்சு நீட்டிப்புகளின் குறுக்குவெட்டு) விளைவாக்கம் செய்யப்படுகிறது.",
      "objective": "குறிக்கோள்",
      "eyepiece": "கண் பார்வை"
    },
    "telescope": {
      "title": "தொலைநோக்கி",
      "description": "இது ஒரு எளிய தொலைநோக்கியின் உருவகப்படுத்துதல் ஆகும், இது ஒரு குவிந்த லென்ச் மற்றும் ஒரு கலிலியன் [பீம் எக்ச்பாண்டர்](/gallery/beam-expanders) ஆகியவற்றால் ஆனது - இது தொலைநோக்கியின் கோணத் தீர்மானத்தை அதிகரிக்கிறது, இதன் மூலம் உள்வரும் ஒளியை இரண்டு தொலைதூர நட்சத்திரங்களிலிருந்து பிரிக்கிறது.\n\n கீழேயுள்ள ச்கிரீன்சாட்டில் நீங்கள் தொலைநோக்கியின் செயல்திறனை பீம் விரிவாக்கம் இல்லாமல் அதன் பதிப்போடு ஒப்பிடலாம் (ஒரு குவிந்த லென்சை மட்டுமே கொண்டுள்ளது).",
      "lightfromstar2": "விண்மீன் 2 இலிருந்து ஒளி",
      "lightfromstar1": "விண்மீன் 1 இலிருந்து ஒளி",
      "withagallileanbeamex": "ஒரு கலிலியன் பீம் விரிவாக்கத்துடன் (இரு நட்சத்திரங்களின் சிறந்த கோண பிரிப்பு)",
      "screen1": "திரை",
      "withoutabeamexpander": "ஒரு பீம் விரிவாக்கம் இல்லாமல்"
    },
    "keplerianTelescope": {
      "title": "கெப்லெரியன் தொலைநோக்கி",
      "description": "இந்த உருவகப்படுத்துதல் கெப்லேரியன் தொலைநோக்கியின் கதிர் வரைபடத்தை விவரிக்கிறது.",
      "lightfromstar": "நட்சத்திரத்திலிருந்து ஒளி",
      "virtualimage": "மெய்நிகர் படம்",
      "realimage": "உண்மையான படம்",
      "thekepleriantelescop": "கெப்லெரியன் தொலைநோக்கி",
      "eye": "கண்"
    },
    "beamExpanders": {
      "title": "பீம் விரிவாக்கிகள்",
      "description": "இது இரண்டு வகையான பீம் விரிவாக்கிகளின் உருவகப்படுத்துதல் ஆகும் - கெப்லேரியன் பீம் விரிவாக்கம், மற்றும் கலிலியன் பீம் எக்ச்பாண்டர். ஒரு பீம் விரிவாக்கம் மோதிய ஒளியின் கற்றை விட்டம் விரிவாக்குகிறது அல்லது குறைக்கிறது. ஒரு கலிலியன் கற்றை விரிவாக்கம் ஒரு குவிந்த மற்றும் ஒரு குழிவான லென்சால் ஆனது, அதேசமயம் ஒரு கெப்லேரியன் கற்றை விரிவாக்கம் இரண்டு குவிந்த லென்ச்கள் கொண்டது. இரண்டு வகைகளிலும், லென்ச்கள் குவிய நீளத்தின் தொகை அவற்றின் பிரிப்பு தூரத்திற்கு சமம்.",
      "keplerianbeamexpande": "கெப்லேரியன் பீம் விரிவாக்கம்",
      "gallileanbeamexpande": "கலிலியன் பீம் விரிவாக்கம்",
      "inbothcasesthedistan": "இரண்டு சந்தர்ப்பங்களிலும் லென்ச்கள் இடையிலான தூரம் அவற்றின் குவிய தூரத்தின் தொகைக்கு சமம்"
    },
    "rayRelaying": {
      "title": "ரே ரிலேங்",
      "description": "இது தொடர்ச்சியான லென்ச்கள் இடையே குவிய நீளம் \\(F \\) மற்றும் தூரம் \\(d \\) கொண்ட நிலையான ஒரே மாதிரியான லென்ச்கள் மூலம் கதிர் ரிலேயின் உருவகப்படுத்துதல் ஆகும். \\(D \\leq 4f \\) என்றால் மட்டுமே வழங்கப்படாத கதிர் பாதை பொறுப்பு அளிக்கப்படுகிறது.",
      "youcanselectanylenst": "வரிசையின் அளவுருக்களைக் காணவும் சரிசெய்யவும் எந்த லென்சையும் தேர்ந்தெடுக்கலாம்."
    },
    "rochesterCloak": {
      "title": "ரோசெச்டர் க்ளோக்",
      "description": "ரோசெச்டர் க்ளோக் என்பது ஒரு வகை குளோக்கிங் சாதனமாகும், இது 4 லென்ச்கள் மட்டுமே பயன்படுத்துகிறது. இந்த உருவகப்படுத்துதலில் வழங்கப்பட்ட பதிப்பில், இரண்டு வெளிப்புற லென்ச்களின் குவிய நீளம் \\(f_1 \\), மற்றும் இரண்டு மிட் லென்ச்கள் \\(f_2 \\) ஆகும், அதாவது குவிய நீளங்களின் தொடர்ச்சியான லென்ச்கள் \\(f_1 \\.",
      "observerdoesntseethe": "பார்வையாளர் (பொருள்களைப் பார்க்கவில்லை\n பகுதி கண்ணுக்குத் தெரியாத பகுதியிலிருந்து,\n ஆனால் தெரிவுநிலை பகுதியிலிருந்து பொருளைப் பார்க்கிறது)",
      "partialinvisibilitya": "பகுதி கண்ணுக்குத் தெரியாத பகுதி",
      "object": "பொருள்",
      "t8objects": "8 பொருள்கள்",
      "visibilityarea": "தெரிவுநிலை பகுதி"
    },
    "simpleDoubleGaussLens": {
      "title": "எளிய இரட்டை-காச் லென்ச்",
      "description": "இது ஒரு எளிய இரட்டை-காச் லென்சின் ஆர்ப்பாட்டமாகும்."
    },
    "pairOfAxiconsMakingARainbowRing": {
      "title": "வானவில் வளையத்தை உருவாக்கும் ஆக்சிகான்களின் இணை",
      "description": "இந்த உருவகப்படுத்துதல் இரண்டு பிளானோ-குவிந்த ஆக்சிகான்கள், ஒரு வெள்ளை ஒளி மூலத்தையும், துளை வானவில்லை உருவாக்கவும் பயன்படுத்துகிறது. ஆக்சிகான்கள் கூம்பு லென்ச்கள். உள்வரும் வெள்ளை ஒளி ஒரு குறுகிய வளைய துளை மூலம் உருவாக்கப்பட்ட ஒரு வளையமாக இருக்க வேண்டும்.\n\n வலது ஆக்சிகானை இடது மற்றும் வலது நகர்த்துவது வெளியீட்டு ரெயின்போ வளையத்தின் அளவை மாற்றும்.",
      "leftaxicon": "இடது ஆக்சிகான்",
      "whitelightsource": "வெள்ளை\n ஒளி\n சான்று",
      "rightaxicon": "வலது ஆக்சிகான்",
      "ringaperture": "வளைய துளை"
    },
    "koehlerIllumination": {
      "title": "கோஅ்லர் வெளிச்சம்",
      "description": "ஆகச்ட் கோஅ்லருக்கு 1893 ஆம் ஆண்டில் கண்டுபிடிக்கப்பட்ட இந்த அமைப்பு, நீங்கள் எந்த வகையான நுண்ணோக்கியையும் கையாளுகிறீர்கள் என்றால் மிகவும் பயனுள்ளதாக இருக்கும். எந்தவொரு ஒத்திசைவற்ற ஒளி மூலத்திலிருந்தும் இது ஒரு மாதிரியில் ஒரே மாதிரியான வெளிச்சத்தை வழங்குகிறது. எனவே வெளிச்ச மூலத்தின் படம் (எ.கா. விளக்கு இழை) மாதிரியில் தெரியவில்லை. இரண்டு துளைகள் தீவிரம் மற்றும் எண் துளை (என்ஏ) அல்லது உங்கள் வெளிச்சத்தின் பார்வைத் துறையை மாற்ற பயன்படுத்தப்படலாம். இரண்டாவது துளை குறிப்பாக சாதகமானது, ஏனெனில் உங்கள் மாதிரியை மையப்படுத்த அதை மூடலாம். துளை விளிம்புகள் கவனம் செலுத்தினால், மாதிரியும் கவனம் செலுத்துகிறது. இது 4F-SETUP என்றும் குறிப்பிடப்படுகிறது, ஏனெனில் இது தூரத்தில் நான்கு குவிய நீளங்களைப் பயன்படுத்துகிறது.",
      "spatiallyextendedand": "இடஞ்சார்ந்த நீட்டிக்கப்பட்ட மற்றும்\n ஒத்திசைவற்ற ஒளி மூல",
      "collectorlens": "கலெக்டர் லென்ச்",
      "aperture1changesinte": "துளை 1\n மாற்றங்கள்\n தீவிரம், நா",
      "fieldlens": "புலம் லென்ச்",
      "aperture2changesfiel": "துளை 2\n மாற்றங்கள்\n பார்வை புலம்",
      "condensorlens": "மின்தேக்கி லென்ச்",
      "objectivelens": "பொருள்நோக்கு வில்லை",
      "sample": "மாதிரி",
      "sampleisnowilluminat": "மாதிரி இப்போது உள்ளது\n ஒரே மாதிரியாக ஒளிரும்"
    },
    "grinSlab": {
      "title": "கிரின் ச்லாப்",
      "description": "இது ஒளிவிலகல் குறியீட்டைக் கொண்ட ஒரு செவ்வக மின்கடத்தா பொருளின் உருவகப்படுத்துதல் ஆகும் \\(n (\\rho) = n_0 \\sqrt {1-(\\ஆல்பா \\rho)^2} \\), அங்கு \\(n_0 = 2 \\) ஒளிவிலகல் ஆகும் அதன் மைய அச்சு மற்றும் \\(\\rho \\) ஆகியவற்றின் குறியீடு அதன் மைய அச்சிலிருந்து ரேடியல் தூரம், அதாவது \\(\\ஆல்பா = \\frac {\\sqrt {3}} {2R} \\) அங்கு \\(r = 100 \\) அதன் ஆரம். இந்த உருவகப்படுத்துதலின் மேல் மின்கடத்தா \\(n (\\rho) \\) இன் படி நிலையான ஒளிவிலகல் குறியீட்டின் மெல்லிய மின்கடத்தா செவ்வகங்களால் ஆனது, அதே நேரத்தில் கீழ் மின்கடத்தா என்பது ஒளிவிலகல் குறியீட்டைக் கொண்ட ஒரு சாய்வு-குறியீட்டு பொருள் \\(n (\\rho) \\).",
      "approximatedmultilay": "தோராயமான மல்டிலேயர் சிரிப்பு ச்லாப் (நீங்கள் n ஐத் தேர்ந்தெடுத்து மாற்றலாம், அடுக்குகளின் எண்ணிக்கை.)",
      "classicalgrinslabyou": "பாரம்பரிய சிரிப்பு ச்லாப் (நீங்கள் எண் தீர்வி படி அளவைத் தேர்ந்தெடுத்து மாற்றலாம்.)"
    },
    "inferiorMirage": {
      "title": "தாழ்வான மிராச்",
      "description": "இது தாழ்வான மிராச் விளைவின் தரமான உருவகப்படுத்துதல் ஆகும். இந்த எடுத்துக்காட்டில் காற்றின் ஒளிவிலகல் குறியீடு, \\(n (y) = \\sqrt {1 + (\\frac {y} {h})^2} \\) செயல்பாட்டுடன் தோராயமாக மதிப்பிடப்படுகிறது, அங்கு \\(h = 600 \\) தரையில் மேலே ஒரு ஒளி உமிழும்/பிரதிபலிக்கும் பொருளின் உயரத்தைக் குறிக்கிறது.",
      "airwithoutinferiormi": "காற்று (தாழ்வான மிராச் விளைவு இல்லாமல்)",
      "airwithinferiormirag": "காற்று (தாழ்வான மிராச் விளைவுடன்)",
      "ground": "மைதானம்",
      "raysemittedreflected": "கதிர்கள் உமிழும்/பிரதிபலித்தன\n ஒரு பொருளிலிருந்து",
      "observerseyenottosca1": "பார்வையாளரின் கண் (அளவிட வேண்டாம்)"
    },
    "seaMirage": {
      "title": "கடல் மிராச்",
      "description": "இது அடிவானத்திற்கு அப்பாற்பட்ட ஒரு பொருளை ஒரு உயர்ந்த மிராசாகத் தெரியும் என்ற விளைவின் ஒரு தரமான உருவகப்படுத்துதல்.",
      "earthssurface": "பூமியின் மேற்பரப்பு",
      "atmosphere": "வளிமண்டலம்",
      "architecturealpine": "கட்டிடக்கலை / ஆல்பைன்",
      "observer1": "நோக்காளன்",
      "vacuum": "வெற்றிடம்",
      "virtualimage1": "மெய்நிகர் படம்"
    },
    "logarithmicSpiralLens": {
      "title": "மடக்கை சுழல் கதிர் பாதை",
      "description": "மடக்கை சுழல் கதிர் பாதைகளை ஆதரிக்கும் ஒளிவிலகல் குறியீட்டு செயல்பாடு \\(r(θ) = r_0\\,e^{-k\\theta}\\) வடிவத்தில் உள்ளது, இங்கு \\(r_0,k > 0\\) மற்றும் \\(\\alpha = \\arctan k\\) என்பது செறிவான மடக்கை சுழல் மற்றும் வட்டத்திற்கு இடையிலான குறுக்குவெட்டுப் புள்ளியில் இரண்டு தொடுகோடுகளுக்கு இடையேயான ஒரு நிலையான கோணமாகும் ([this](https://en.wikipedia.org/wiki/Logarithmic_spiral#/media/File:Logspiral.gif) அசைவுட்டத்தில் காட்டப்பட்டுள்ளபடி), \\(n(r)\\propto\\frac{1}{r} \\) (இதைத் துருவ ஆயத்தொலைவுகளில் ஒளியியல் பாதையை எழுதுவதன் மூலமும், ஃபெர்மட்டின் கொள்கையைப் பயன்படுத்துவதன் மூலமும் காட்டலாம்).",
      "thecircularblockeris": "வட்ட தடுப்பான் மையத்தில் உள்ளது\n ஒளிவிலகல் குறியீட்டு ஒருமைப்பாட்டைத் தவிர்க்க",
      "dragtochangetheiniti": "மாற்ற இழுக்கவும்\n கதிரின் ஆரம்ப திசை",
      "youcanselectthegring": "நீங்கள் கிரின் கிளாசைத் தேர்ந்தெடுக்கலாம்\n எண் தீர்வி படி அளவை மாற்றவும்"
    },
    "luneburgLens": {
      "title": "லுன்பர்க் லென்ச்",
      "description": "இது லுன்பர்க் லென்சின் உருவகப்படுத்துதல் ஆகும், இது ஒளிவிலகல் குறியீட்டைக் கொண்ட ஒரு கோள மின்கடத்தா ஆகும் \\(n (r) = \\sqrt {n_0-(\\frac {R} {r})^2} \\), அங்கு \\(n_0 = 2 \\) என்பது லென்சின் மையத்தில் உள்ள ஒளிவிலகல் குறியீடாகும், \\(r = 100 \\) என்பது லென்சின் ஆரம், மற்றும் \\(r \\) என்பது லென்சின் மையத்திலிருந்து ரேடியல் தூரம்.\n\n மேல் மின்கடத்தா \\(r_i = 5 (n+1-i) \\) மற்றும் ஒளிவிலகல் குறியீட்டு \\(n_i = \\sqrt {n_0-(\\frac {R_i} {R})^2} \\), எங்கே \\(i = 1, \\ldots, n \\). இருப்பினும், இந்த சிமுலேட்டர் ஒரு ஆப்டிகல் உறுப்பின் பயனுள்ள ஒளிவிலகல் குறியீட்டைக் கணக்கிடுவதால், உறுப்புகளின் எண் ஒளிவிலகல் குறியீட்டை அதற்குள் உட்பொதிக்கப்பட்டுள்ள ஆப்டிகல் கூறுகளின் எண் ஒளிவிலகல் குறியீடுகளுடன் பெருக்கி, \\(i \\) செறிவான கோளத்தின் எண் ஒளிவிலகல் குறியீடு லென்ச் \\(n_ {i}^\\உரை {numerical} = \\frac {n_i} {n_ {i-1}} by) வழங்கப்படுகிறது.\n\n கீழ் மின்கடத்தா என்பது ஒளிவிலகல் குறியீட்டைக் கொண்ட ஒரு சாய்வு-குறியீட்டு பொருள் \\(n (r) \\).",
      "approximatedmultilay1": "தோராயமான மல்டிலேயர் லுன்பர்க் லென்ச் (நீங்கள் n ஐத் தேர்ந்தெடுத்து மாற்றலாம், அடுக்குகளின் எண்ணிக்கை.)",
      "classicalluneburglen": "பாரம்பரிய லுன்பர்க் லென்ச் (நீங்கள் எண் தீர்வி படி அளவைத் தேர்ந்தெடுத்து மாற்றலாம்.)"
    },
    "maxwellFisheyeLens": {
      "title": "மேக்ச்வெல் ஃபிசே லென்ச்",
      "description": "இது ஒரு மேக்ச்வெல் மீன்-கண் லென்சின் உருவகப்படுத்துதல் ஆகும், இது ஒளிவிலகல் குறியீட்டு \\(n (r) = \\frac {n_0} {1+(\\frac {R} {R})^2} \\) கொண்ட ஒரு கோள மின்கடத்தா ஆகும்) . .\n\n மேல் மின்கடத்தா \\(r_i = 5 (n+1-i) \\) மற்றும் ஒளிவிலகல் குறியீட்டு \\(n_i = \\frac {n_0} {1+(\\frac {R_i} {r})^2} \\), எங்கே \\(i = 1, \\ldots, n \\). இருப்பினும், இந்த சிமுலேட்டர் ஒரு ஆப்டிகல் உறுப்பின் பயனுள்ள ஒளிவிலகல் குறியீட்டைக் கணக்கிடுவதால், உறுப்புகளின் எண் ஒளிவிலகல் குறியீட்டை அதற்குள் உட்பொதிக்கப்பட்டுள்ள ஆப்டிகல் கூறுகளின் எண் ஒளிவிலகல் குறியீடுகளுடன் பெருக்கி, \\(i \\) செறிவான கோளத்தின் எண் ஒளிவிலகல் குறியீடு லென்ச் \\(n_ {i}^\\உரை {numerical} = \\frac {n_i} {n_ {i-1}} by) வழங்கப்படுகிறது.\n\n கீழ் மின்கடத்தா என்பது ஒளிவிலகல் குறியீட்டைக் கொண்ட ஒரு சாய்வு-குறியீட்டு பொருள் \\(n (r) \\).",
      "approximatedmultilay2": "தோராயமான மல்டிலேயர் மேக்ச்வெல் ஃபிசே லென்ச் (நீங்கள் n ஐத் தேர்ந்தெடுத்து மாற்றலாம், அடுக்குகளின் எண்ணிக்கை.)",
      "classicalmaxwellfish": "பாரம்பரிய மேக்ச்வெல் ஃபிசே லென்ச் (நீங்கள் எண் தீர்வி படி அளவைத் தேர்ந்தெடுத்து மாற்றலாம்.)"
    },
    "branchedFlow": {
      "title": "Branched பாய்வு",
      "description": "ஒளி ஒரு ஊடகம் வழியாக பயணிக்கும்போது, அதன் ஒளிவிலகல் குறியீட்டில் சீரற்ற இடஞ்சார்ந்த ஏற்ற இறக்கங்கள் உள்ளன (ஒளியின் அலைநீளத்தை விட தொடர்பு நீளத்துடன்), கிளை ஓட்டம் எனப்படும் மரம் போன்ற முறை தோன்றும். இந்த உருவகப்படுத்துதல் இந்த நிகழ்வை ஒளிவிலகல் குறியீட்டு செயல்பாட்டைப் பயன்படுத்தி காட்டுகிறது, இது சீரற்ற போன்ற பெருக்கங்கள், அலை திசையன்கள் மற்றும் கட்டங்களுடன் பல கொசைன் செயல்பாடுகளின் கூட்டுத்தொகையாகும்."
    },
    "singleRayDemo": {
      "title": "ஒற்றை கதிர் டெமோ",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு கதிரின் பிரதிபலிப்பு மற்றும் ஒளிவிலகலை நிரூபிக்கிறது."
    },
    "sphericalLensAndMirror": {
      "title": "கோள லென்ச் மற்றும் கண்ணாடி",
      "description": "இந்த உருவகப்படுத்துதல் ஒரு கோள லென்ச் மற்றும் ஒரு கோள கண்ணாடி வழியாக செல்லும் தொடர்ச்சியான கற்றை காட்டுகிறது."
    },
    "interrogationRoom": {
      "title": "வினவல் அறை",
      "description": "இது ஒரு வினவல் அறையில் இரு வழி கண்ணாடியின் உருவகப்படுத்துதல். இருண்ட அறையில் உள்ள பார்வையாளர் (வெறுமனே இருண்ட அறையின் உள்துறை ஒளியை வெளியிடுகிறது/பிரதிபலிக்கவில்லை, அதே போல் உள்வரும் அனைத்து ஒளியையும் விசாரிக்கும் அறையிலிருந்து உறிஞ்சுகிறது) வினவல் அறைக்குள் பார்க்க முடிகிறது, ஏனெனில் விசாரணையில் விளக்கால் உருவாக்கப்பட்ட ஒளி விசாரணையில் உள்ளது அறை இரு வழி கண்ணாடியின் மூலம் பார்வையாளரால் சிதறடிக்கப்பட்டு பெறப்படுகிறது, அதேசமயம் சந்தேக நபர் வினவல் அறைக்குள் மற்றும் அவரது/அவள் மற்றும் விளக்கின் பிரதிபலிப்புகள் மட்டுமே பார்க்க முடியும் (இருண்ட அறையிலிருந்து சந்தேக நபரால் எந்த ஒளியும் கிடைக்கவில்லை என்பதால்).",
      "pressonallimagestose": "இருப்பிடத்தைக் காண \"அனைத்து படங்களையும்\" அழுத்தவும்\n விளக்கு பிரதிபலிப்பு, மற்றும் பொருள்கள்\n சந்தேக நபர் மற்றும் பார்வையாளரின் பட விமானத்தில்",
      "darkroom": "இருண்ட அறை",
      "twowaymirror": "இருவழி கண்ணாடி",
      "lamp": "விளக்கு",
      "interrogationroom": "வினவல் அறை",
      "observerseyeris": "பார்வையாளரின் கண்",
      "suspectseyeris": "சந்தேக நபரின் கண்",
      "thelampobjectinthesu": "சந்தேக நபரின் பட விமானத்தில் விளக்கு பொருள்",
      "thelampsreflectionin": "சந்தேக நபரின் பட விமானத்தில் விளக்கு பிரதிபலிப்பு",
      "thelampsreflection": "விளக்கு பிரதிபலிப்பு",
      "thelampobjectintheob": "பார்வையாளரின் பட விமானத்தில் விளக்கு பொருள்"
    },
    "cameraObscura": {
      "title": "கேமரா அப்சுரா",
      "description": "இது ஒரு கேமரா தெளிவின் உருவகப்படுத்துதல். இருண்ட அறையில் உள்ள பார்வையாளர் வெளியே உள்ள பொருட்களின் தலைகீழ் படத்தைக் காண்கிறார், அவர்/அவள் முன் சுவரில் திட்டமிடப்பட்டுள்ளது (கூடுதல் லென்சைப் பயன்படுத்தாமல்).",
      "observer2": "நோக்காளன்",
      "objectsoutside": "வெளியே பொருள்கள்",
      "darkroom1": "இருண்ட அறை"
    },
    "thePrincipleOfCameraImaging": {
      "title": "கேமரா இமேசிங்கின் கொள்கை",
      "description": "இந்த வார்ப்புரு கேமரா இமேசிங்கின் கொள்கைகளைக் கற்றுக்கொள்வதற்கும், குவிய நீளம், துளை, சென்சார் உணர்திறன் மற்றும் பின்னணி மங்கலானது போன்ற அத்தியாவசிய தலைப்புகளை உள்ளடக்கிய ஒரு ஊடாடும் அணுகுமுறையை வழங்குகிறது, இது மாணவர்கள் மற்றும் ஆர்வலர்களுக்கு பயனுள்ளதாக இருக்கும்.",
      "camera": "கேமரா",
      "cmos": "CMOS"
    },
    "nlSimulation": {
      "title": "என்.எல் தொலைநோக்கிகள்",
      "description": "இந்த உருவகப்படுத்துதல் ச்வரோவ்ச்கி என்.எல் தொலைநோக்கியின் தோராயமான ஓவியத்தைக் காட்டுகிறது."
    },
    "einsteinRingRefocusedToSingleImageViaEyepiece": {
      "title": "ஐன்ச்டீன் மோதிரம் கண் பார்வை வழியாக ஒற்றை படத்திற்கு கவனம் செலுத்தியது",
      "description": "இது ஒரு கண் பார்வை/லென்சின் மாதிரியாகும், இது எந்தவொரு விஞ்ஞான தொலைநோக்கியிலும் பயன்படுத்தப்படலாம், இது \"ஒளிவட்டத்தை\" மாற்றியமைத்து, ஐன்ச்டீன் வளையத்தை அதன் அசல் வடிவத்தில் கவனம் செலுத்துகிறது, அதே நேரத்தில் வளையத்தை உருவாக்கப் பயன்படுத்தப்படும் எந்த நட்சத்திரத்தின் ஒளியையோ அல்லது மிகப்பெரிய பொருளையும் சிதறடிக்கும்."
    },
    "blackCatBecomesWhite": {
      "title": "\"கருப்பு பூனை வெள்ளை ஆகிறது\" டெமோ",
      "description": "\"பிளாக் கேட் ஒயிட் ஆகிறது\" என்பது ஒரு பிரபலமான அறிவியல் டெமோ ஆகும், இதில் தண்ணீரில் வைக்கும்போது ஒரு உருவத்தின் சில பகுதி மறைந்துவிடும். இது பின்வரும் படிகளுடன் செய்யப்படுகிறது:\n\n 1. ஒரு துண்டு காகிதத்தில் ஒரு உருவத்தை (எ.கா. ஒரு கருப்பு பூனை) வரையவும்.\n 2. காகிதத்தை ஒரு பிளாச்டிக் சிப்-லாக் பையில் வைக்கவும்.\n 3. உருவத்தின் ஒரு பகுதியை (எ.கா. பூனையின் எல்லை) அல்லது பிளாச்டிக் மேற்பரப்பில் வேறு சில உருவங்களை வரையவும். தண்ணீரில் வைக்கும்போது, காகிதத்தில் வரையப்பட்ட உருவம் மறைந்துவிடும், ஆனால் பிளாச்டிக் மேற்பரப்பில் வரையப்பட்ட பகுதி அல்ல.\n\n இந்த உருவகப்படுத்துதல் இது எவ்வாறு செயல்படுகிறது என்பதை விளக்குகிறது.",
      "whenthebagisunderwat": "பை நீருக்கடியில் இருக்கும்போது, காகிதத்திலிருந்து வரும் ஒளி கண்களை அடையாது,\n எனவே பிளாச்டிக் மேற்பரப்பில் வரையப்பட்ட உருவத்தை மட்டுமே நாம் காண்கிறோம்.",
      "lightfromtheplastics": "பிளாச்டிக் மேற்பரப்பில் இருந்து ஒளி",
      "lightfromthepaper": "காகிதத்திலிருந்து ஒளி",
      "eyes": "கண்கள்",
      "dragtomovethebagouto": "பையை தண்ணீரிலிருந்து வெளியேற்ற இழுக்கவும்"
    },
    "dichroicRbgSplitterAndCombiner": {
      "title": "டிக்ரோயிக் ஆர்சிபி ச்ப்ளிட்டர் & காம்பினர்",
      "description": "இந்த உருவகப்படுத்துதல் டைக்ரோயிக் கண்ணாடியைப் பயன்படுத்தி ஆர்சிபி விட்டங்களின் பிளவு மற்றும் கலவையை நிரூபிக்கிறது.",
      "rgbcomponentsplitter": "RGB உபகரண ச்ப்ளிட்டர் மற்றும் காம்பினர்",
      "lightsource": "ஒளி மூல",
      "dichroiccube": "டிக்ரோயிக் கியூப்",
      "beamcombiner": "பீம் காம்பினர்"
    },
    "ganBasedLcdPixel": {
      "title": "எல்சிடி படப்புள்ளி",
      "description": "இது எல்சிடி பிக்சலின் மாதிரி. புதிய மைக்ரோலெட் காட்சி அடுக்குகள் எவ்வாறு செயல்படுகின்றன என்பதையும், நம் கண்கள் பிக்சலை எவ்வாறு உணர்கின்றன என்பதையும் இது உருவகப்படுத்துகிறது.",
      "pixelsaresosmallthel": "படப்புள்ளிகள் மிகவும் சிறியவை\n நம் கண்களில் கலந்ததாகத் தெரிகிறது",
      "changetherateoftrans": "பரிமாற்ற விகிதத்தை மாற்றவும்\n எந்த RGB மதிப்பையும் உருவாக்க",
      "blueledbacklight": "நீல எல்.ஈ.டி பின்னொளி",
      "yellowphosphor": "மஞ்சள் பாச்பர்",
      "liquidcrystal": "திரவ படிக",
      "lightfilters": "ஒளி வடிப்பான்கள்",
      "pixelasvisibletoview": "பார்வையாளருக்கு தெரியும் படப்புள்ளி",
      "notpartoflcddisplay": "எல்சிடி டிச்ப்ளேவின் ஒரு பகுதியாக இல்லை"
    },
    "concaveMirrorWearableDisplay": {
      "title": "குழிவான கண்ணாடி அணியக்கூடிய காட்சி",
      "description": "ஒரு எளிய அணியக்கூடிய காட்சி. நிறைய வடிவமைப்புகள் இரண்டு கண்ணாடிகள் மற்றும் நேர்மறை லென்சைப் பயன்படுத்துகின்றன, ஆனால் இது ஒரு ஆப்டிகல்-உறுப்பு பதிப்பாகும். அளவு சுமார் 5: 1 மி.மீ.\n\n CC0: இந்த வேலை பொது களத்திற்கு அர்ப்பணிக்கப்பட்டதாக குறிக்கப்பட்டுள்ளது.",
      "tft09display": "TFT 0.9 \"காட்சி",
      "concavemirror": "குழியாடி",
      "eye1": "கண்",
      "nose": "மூக்கு",
      "pointsourcetomeasure": "ஆரம் அளவிட புள்ளி மூல",
      "t15readingglasses": "+1.5 கண்ணாடிகளைப் படித்தல்"
    },
    "reflectingMonochromator": {
      "title": "மோனோக்ரோமேட்டரை பிரதிபலிக்கிறது",
      "description": "இது பிரதிபலிக்கும் மோனோக்ரோமேட்டரின் உருவகப்படுத்துதல் ஆகும், இது ஒரு பிரதிபலிப்பு வேறுபாடு ஒட்டுதல் மற்றும் கலப்பு ஒளியிலிருந்து குறுகிய இசைக்குழு அலைநீளங்களைப் பெறுவதற்கு கவனம் செலுத்துவதில் ஒரு பிளவு ஆகியவற்றைப் பயன்படுத்துகிறது.",
      "reflectingmonochroma": "மோனோக்ரோமேட்டரை பிரதிபலிக்கிறது",
      "rotatediffractiongra": "டிஃப்ராஃப்ரக்சன் ஒட்டுதல் சுழற்றுங்கள்\n குறுகிய இசைக்குழுவைப் பெற\n இருந்து அலைநீளங்கள்\n கூட்டு ஒளி",
      "exitslitmonochromati": "வெளியேறும் பிளவு\n\n ஒற்றை நிற ஒளி"
    },
    "solarEclipses": {
      "title": "சூரிய கிரகணங்கள்",
      "description": "இந்த உருவகப்படுத்துதல் பல்வேறு வகையான சூரிய கிரகணங்களை நிரூபிக்கிறது. மேல்-வலது வரைபடம் ஒரு சூரிய கிரகணத்தை சித்தரிக்கிறது, அங்கு சந்திரனின் நிழல் சூரியனை உள்ளடக்கியது, இதன் விளைவாக மையத்தில் மொத்த கிரகணம் மற்றும் சுற்றியுள்ள பகுதிகளில் ஒரு பகுதி கிரகணம் ஏற்படுகிறது. கீழ்-வலது வரைபடம் ஒரு வருடாந்திர கிரகணத்தை விளக்குகிறது, அங்கு சந்திரன் பூமியிலிருந்து சூரியனை முழுவதுமாக மறைக்க வெகு தொலைவில் உள்ளது, மையத்தில் ஒரு பிரகாசமான வளையத்தை விட்டுச்செல்கிறது (இந்த 2 டி சிமுலேட்டரில், \"மோதிரம்\" சூரிய ஒளியால் நிரூபிக்கப்படுகிறது சூரியனின் கீழ் பகுதி) மற்றும் சுற்றியுள்ள பகுதிகளில் ஒரு பகுதி கிரகணம்.",
      "nottoscale": "(அளவிட வேண்டாம்)",
      "sun": "சூரியன்",
      "moon": "சந்திரன்",
      "partialeclipse": "பகுதி கிரகணம்",
      "annulareclipse": "ஆண்டு கிரகணம்",
      "earth": "பூமி",
      "totaleclipse": "மொத்த கிரகணம்"
    },
    "moduleExampleBasics": {
      "title": "தொகுதி எடுத்துக்காட்டு - அடிப்படைகள்",
      "thistextisinexamplem": "இந்த உரை எடுத்துக்காட்டுகளில் உள்ளது.",
      "thistextisalsoinexam": "இந்த உரை ஆய்வு.",
      "thistextisnotinamodu": "இந்த உரை ஒரு தொகுதியில் இல்லை.",
      "thistextisalsonotina": "இந்த உரை ஒரு தொகுதியில் இல்லை."
    },
    "moduleExampleParameters": {
      "title": "தொகுதி எடுத்துக்காட்டு - அளவுருக்கள்",
      "thismodulehastwopara": "இந்த தொகுதி இரண்டு அளவுருக்களைக் கொண்டுள்ளது: n = `n` மற்றும் தீட்டா =` தீட்டா`.\n அவற்றை சரிசெய்ய ச்லைடர்களைத் தேர்ந்தெடுத்து இழுக்கலாம்.",
      "thesizeofthistextosc": "இந்த உரையின் அளவு தீட்டாவின் செயல்பாடாக ஊசலாடுகிறது."
    },
    "moduleExampleControlPoints": {
      "title": "தொகுதி எடுத்துக்காட்டு - கட்டுப்பாட்டு புள்ளிகள்",
      "hereisthefirstdragga": "↙ இங்கே தொகுதியின் முதல் (இழுக்கக்கூடிய) கட்டுப்பாட்டு புள்ளி",
      "hereistheseconddragg": "↙ இங்கே தொகுதியின் இரண்டாவது (இழுக்கக்கூடிய) கட்டுப்பாட்டு புள்ளி",
      "hereisthemidpoint": "↙ இங்கே நடுப்பகுதி"
    },
    "moduleExampleArraysAndConditionals": {
      "title": "தொகுதி எடுத்துக்காட்டு - வரிசைகள் மற்றும் நிபந்தனைகள்",
      "a1darrayii": "ஒரு 1 டி வரிசை: i = `i`",
      "thistextisshownonlyw": "இந்த உரை n> 5 ஆக இருக்கும்போது மட்டுமே காட்டப்படும்"
    },
    "moduleExampleVariables": {
      "title": "தொகுதி எடுத்துக்காட்டு - மாறிகள்"
    },
    "moduleExampleCustomEquation": {
      "title": "தொகுதி எடுத்துக்காட்டு - தனிப்பயன் சமன்பாடு",
      "amirrorofshapeycos2p": "வடிவத்தின் கண்ணாடி ஒய் = cos (2 pi ஃச் + `phi`)"
    },
    "moduleExampleShapeParametrization": {
      "title": "தொகுதி எடுத்துக்காட்டு - வடிவ அளவுரு",
      "alensdefinedbydr1r2": "டி, ஆர்_1, ஆர்_2 ஆல் வரையறுக்கப்பட்ட லென்ச்",
      "alensdefinedbydffdbf": "டி, எஃப்.எஃப்.டி, பி.எஃப்.டி ஆல் வரையறுக்கப்பட்ட லென்ச்"
    }
  }
}
